# -*- coding: utf-8 -*-
"""
Задание 5.4

Запросить у пользователя ввод IP-сети в формате: 10.1.1.0

Затем вывести информацию о сети и маске в таком формате:

Network:
10        1         1         0
00001010  00000001  00000001  00000000


Проверить работу скрипта на разных комбинациях сеть/маска.
"""

network = input("Введите адрес сети: ")

ip_list = network.split(".")

oct1, oct2, oct3, oct4 = [
    int(ip_list[0]),
    int(ip_list[1]),
    int(ip_list[2]),
    int(ip_list[3]),
]

ip_output = """
Network:
{0:<8}  {1:<8}  {2:<8}  {3:<8}
{0:08b}  {1:08b}  {2:08b}  {3:08b}"""

print(ip_output.format(oct1, oct2, oct3, oct4))
